app/controllers/categories_controller.rb

  def show
    @jobs = Job.all
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]