app/controllers/companies_controller.rb

  def create
    @company = Company.new
    @company.name = params[:company][:name]
    @company.location = params[:company][:location]
    @company.mail = params[:company][:mail]
    @company.phone = params[:company][:phone]
    @company.save
---
INSERT INTO "companies" ("name", "location", "mail", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Campus Code"], ["location", "São Paulo"], ["mail", "contato@campus.com.br"], ["phone", "2369-3476"], ["created_at", 2017-02-25 18:51:49 UTC], ["updated_at", 2017-02-25 18:51:49 UTC]]