app/controllers/jobs_controller.rb

  def index
    @jobs = Job.all
    @companies = Company.all
---
SELECT "companies".* FROM "companies"

  def new
    @job = Job.new
    @companies =  Company.all
---
SELECT "companies".* FROM "companies"

  def create
    @companies =  Company.all
---
SELECT "companies".* FROM "companies"

  def edit
    @job = Job.find(params[:id])
    @companies = Company.all
---
SELECT "companies".* FROM "companies"

  def update
    @companies = Company.all
---
SELECT "companies".* FROM "companies"